Repository: Clediano/portfolio
Catalog: lib/l10n/*.arb
Languages: pt

# projectTitle
source: Portfolio
pt: Portfólio

# ptLanguage
source: Portuguese
pt: Português

# enLanguage
source: English
pt: Inglês

# appBarStart
source: Start
pt: Início

# appBarAbout
source: About me
pt: Sobre mim

# appBarExperience
source: Experience
pt: Experiência

# appBarContact
source: Contact
pt: Contato

# aboutMessage1
source: Hello, my full name is
pt: Olá, meu nome completo é

# aboutMessage2
source: and I'm a full stack developer.
pt: e sou um desenvolvedor full stack.

# aboutMessage3
source: I'm graduated in Computer Science and postgraduate in Development of Software in Java. My career started in
pt: Sou formado em Ciência da Computação e pós-graduado em Desenvolvimento de Software com Java. Minha carreira na área iniciou em

# aboutMessage5
source: , working in a development company as an User Support Assistant.
pt: , trabalhando em uma empresa de desenvolvimento como Assistente de Apoio ao Usuário.

# aboutMessage6
source: I like challenges that the programming imposes,
pt: Gosto dos desafios que a programação impõe,

# aboutMessage7
source: resolve a pain of somebody
pt: resolver a dor de alguém

# aboutMessage8
source: using programming code
pt: através de código

# aboutMessage9
source: is as satisfying as drinking a cup of coffee!
pt: é tão satisfatório quanto beber uma xícara de café!

# startMessage1
source: Hi, my name is
pt: Olá, meu nome é

# startMessage2
source: and I'm software developer
pt: e sou desenvolvedor de software

# startButtonCV
source: See CV
pt: Ver CV

# startButtonGitHub
source: See GitHub
pt: Ver GitHub

# startButtonGitHubMobile
source: See GitHub
pt: GitHub

# companyKnowMoreButton
source: Know more
pt: Saiba mais

# companyCloseButton
source: Close
pt: Fechar

# companyDetail1
source: A global leader in consulting, technology services and digital transformation, Capgemini is at the forefront of innovation to address the entire breadth of clients’ opportunities in the evolving world of cloud, digital and platforms.
pt: Capgemini é líder global em serviços de consultoria, transformação digital, tecnologia e engenharia. O Grupo está na vanguarda da inovação para abordar toda a amplitude de oportunidades dos clientes no mundo em evolução da nuvem, digital e plataformas.

# companyDuration1
source: Dec 2021 - Present
pt: dez de 2021 - o momento

# experienceTitle1
source: Customized Solutions Consultant
pt: Consultor de Soluções Customizadas

# experienceSubTitle1
source: Until the moment
pt: Até o momento

# experienceDescription1
source: I work in the frontend team of Bradesco Cards. Here we develop functionalities for an online card management platform for legal entities. We are using ReactJS technology, creating reusable components with libraries like Redux for state management.
pt: Atuo na equipe frontend da Bradesco Cartões. Aqui desenvolvemos funcionalidades para uma plataforma online de gerenciamento de cartões para pessoas jurídicas. Estamos usando a tecnologia ReactJS, criando componentes reutilizáveis com bibliotecas como Redux para gerenciamento de estado.

# companyDetail2
source: Evoluum was born in 2018, as a software factory, by the hands of two people who realized that the traditional model of a software factory was outdated and problematic, because a factory normally generates source code, not value. It was then that they took on the challenge of evolving the way software is made through outsourcing.
pt: A Evoluum nasceu em 2018, como uma fábrica de software, pelas mãos de duas pessoas que perceberam que o modelo tradicional de fábrica de software era ultrapassado e problemático, pois fábrica, normalmente gera código fonte, e não valor. Foi então que assumiram o desafio de evoluir a forma como se faz software através do outsourcing.

# companyDuration2
source: Duration: 8 months
pt: Duração: 8 meses

# experienceTitle2
source: Software Engineer
pt: Engenheiro de Software

# experienceSubTitle2
source: May 2021 - Dec 2021
pt: mai de 2021 - dez de 2021

# experienceDescription2
source: I worked on a project with microservices using technologies such as Java and Spring-Boot, in which I worked as a full-stack developer, participating in all stages of development. We used Apache-Kafka for the communication between the microservices and Flutter for the development of the Konta application. I participated in continuous improvement meetings where we discussed as a team what would be the best approach to a given situation, we discussed our internal processes and what to do to improve it. I was just a dev within an amazing squad, we were always looking for our best, so we grew and developed our skills together.
pt: Trabalhei em um projeto com microsserviços utilizando tecnologias como Java e Spring-Boot, nele eu atuei como desenvolvedor full-stack, participando de todas as etapas do desenvolvimento. Utilizamos Apache-Kafka para a comunicação entre os microsserviços e Flutter para o desenvolvimento do aplicativo Konta(aplicativo do setor varejista de uma rede de lojas de Santa Catarina). Participei de reuniões de melhoria contínua onde discutíamos em equipe qual seria a melhor abordagem para determinada situação, discutíamos sobre nossos processos internos e o que fazer para melhorá-lo. Eu era apenas um dev dentro de uma squad incrível, buscávamos sempre o nosso melhor, portanto, crescíamos e desenvolvíamos nossas skills juntos.

# companyDetail3
source: Each Customer is unique and deserves exclusive service, the 'one to one' concept that respects the individuality of each organization is present in MICROSYS®'s more than 25 years of operation. Attentive to the evolution of market needs and always creating new ways to increase the potential for action of people and organizations, MICROSYS® constantly invests in the qualification and improvement of its professionals, developing innovative, dynamic and intuitive solutions.
pt: Como cada Cliente é único e merece um atendimento exclusivo, o conceito ‘one to one’ que respeita a individualidade de cada organização está presente nos mais de 25 anos de atuação da MICROSYS®. Atenta a evolução das necessidades do mercado e criando sempre novas formas de aumentar o potencial de agir das pessoas e das organizações, a MICROSYS® investe constantemente na qualificação e aprimoramento de seus profissionais, desenvolvendo soluções inovadoras, dinâmicas e intuitivas.

# companyDuration3
source: Duration: 5yrs 3 months
pt: Duração: 5 anos e 3 meses

# experienceTitle31
source: Software Developer
pt: Desenvolvedor de Software

# experienceSubTitle31
source: Aug 2020 - May 2021 · 10 mos
pt: ago de 2020 - mai de 2021 · 10 meses

# experienceDescription31
source: I worked with the development and maintenance of commercial and industrial management systems. He was part of the company's Web and Mobile development team. I helped in the definition of technologies and patterns of systems projects. I tried to interact with colleagues in order to keep the atmosphere relaxed and welcoming, I understand that in this way communication between the team is greater and facilitates when I need to help or be helped. I had the opportunity to work in an amazing team, where I was able to put into practice several concepts and tools, as well as improve my soft skills with my friends.
pt: Trabalhei com o desenvolvimento e manutenção de sistemas de gestão comercial e industrial. Fazia parte da equipe de desenvolvimento Web e Mobile da empresa. Ajudei na definição de tecnologias e padrões de projetos dos sistemas. Procurava interagir com os colegas de forma a manter o ambiente descontraído e acolhedor, entendo que desta forma a comunicação entre a equipe é maior e facilita nos momentos em que preciso ajudar ou ser ajudado. Tive a oportunidade de trabalhar em uma equipe incrível, onde pude colocar em prática vários conceitos e ferramentas, além de aprimorar minhas soft skills com meus amigos.

# experienceTitle32
source: Assistant of Programming
pt: Assistente de Programação

# experienceSubTitle32
source: May 2018 - Aug 2020 · 2 yrs 4 mos
pt: mai de 2018 - ago de 2020 · 2 anos 4 meses

# experienceDescription32
source: I worked with the development of Commercial Web applications and Industrial Technologies, using technologies in Java and JavaScript languages, making use of frameworks and libraries such as Spring-Boot, ReactJS and creating REST APIs, web and mobile applications.
pt: Trabalhei com o desenvolvimento de aplicações Web Comerciais e Industriais, utilizando tecnologias baseadas nas linguagens Java e JavaScript, fazendo uso de frameworks e bibliotecas como Spring-Boot, ReactJS e Flutter para criar API's REST, aplicações web e para celulares.

# experienceTitle33
source: Assistant of Helpdesk
pt: Assistente de Apoio ao Usuário

# experienceSubTitle33
source: May 2016 - May 2018 · 2 yrs 1 mo
pt: mai de 2016 - mai de 2018 · 2 anos 1 mês

# experienceDescription33
source: I started my career in IT. I was already studying Computer Science and had some notion of programming logic. It didn't take me long to start getting my hands dirty, or rather, in the code! I developed personal projects with the technologies that I was studying in college, challenging myself from an early age.
pt: Iniciei da minha carreira na área de TI. Já estudava Ciência da Computação e tinha alguma noção de lógica de programação. Não demorei muito pra começar a colocar a mão na massa, ou melhor dizendo, no código! Desenvolvia projetos pessoais com as tecnologias que eu estudava na faculdade, desde cedo me desafiando.
